Documents/ДействияЗаСутки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ДействияЗаСутки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СписанныеТовары</xr:Item>
				<xr:Item>InformationRegister.ВыполнениеДействийСтационара</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
				<xr:Item>InformationRegister.ВыполнениеПланаЛечения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомментарийДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеТоваров</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДействияСтационара</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МедицинскаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидыДействийСтационара</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДействийСтационара</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействиеСтационара</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СправочникМеждународныхНепатентованныхНаименований</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.ДействияМедсестрыСтационара</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервичныйПрием</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Прием</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЭлемента</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВремяВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Прием</v8:Type>
								<v8:Type>cfg:DocumentRef.ИзменениеРежима</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоВечер</Name>
							<Comment>Для параметров Температурного листа определяет, утренний это или вечерний замер показателя</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Перерасход</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КомментарийДокумента</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыДействийСтационара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыДействийСтационара</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Процедуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Манипуляции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Медикаменты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Comment>Виды номенклатуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
					<Comment>Основной вид ТМЦ, учитываемый на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Услуга, не хранится на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СписаниеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СписаниеТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ИнвентаризацияТоваров</xr:Item>
				<xr:Item>Document.ПеремещениеМатериалов</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СписанныеТовары</xr:Item>
				<xr:Item>AccumulationRegister.Затраты</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеМатериалов</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтнесеноНаЗатраты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияВыработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ДействияЗаСутки/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма, Ложь);
	
	Элементы.ГруппаСписаниеТоваров.Видимость = РассчитатьВидимостьСписанияТоваров(Объект.Дата, Объект.СписаниеТоваров);
	Элементы.КомандаСоздатьСписаниеТоваров.Видимость = Не ЗначениеЗаполнено(Объект.СписаниеТоваров);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	
	Если Истина // ИспользоватьПодключаемоеОборудование Проверка на включенную ФО "Использовать ВО"
	   И МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда // Проверка на определенность рабочего места ВО.
		ОписаниеОшибки = "";
		
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
		
		ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключитьОборудованиеЗавершение", ЭтотОбъект);    
		МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(ОповещенияПриПодключении, УникальныйИдентификатор, ПоддерживаемыеТипыВО);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	// МеханизмВнешнегоОборудования
	ПоддерживаемыеТипыВО = Новый Массив();
	ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоТипу(Неопределено, УникальныйИдентификатор, ПоддерживаемыеТипыВО);
	// Конец МеханизмВнешнегоОборудования

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ДействияСтационара.Количество() = 0 Тогда 
		Предупреждение("Табличная часть документа пуста! Запись невозможна");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(ТекущийОбъект,,ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ScanData" Тогда
		Если ВводДоступен() Тогда
			ТипШК = Неопределено;
			РаботаСТорговымОборудованиемКлиент.ОбработатьСобытиеСШКФормы(ЭтотОбъект, Параметр, ТипШК);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр( "ru = 'При подключении оборудования произошла ошибка:
				|""%ОписаниеОшибки%"".'" );
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиДинамическиСоздаваемыхКоманд

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВывестиДвиженияДокумента(Команда)
	РаботаСДиалогамиКлиент.ВывестиДвиженияДокумента(Объект.Ссылка, Команда);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура КомандаСоздатьСписаниеТоваров(Команда)
	
	Если РаботаСДиалогамиКлиент.ПроверитьМодифицированностьВФорме(ЭтаФорма, Истина) Тогда
		Если Не ЗначениеЗаполнено(Объект.СписаниеТоваров) Тогда
			РезультатСоздания = СоздатьДокументСписания(Объект.Ссылка);
			Если ТипЗнч(РезультатСоздания) = Тип("Строка") Тогда
				ПоказатьПредупреждение(, РезультатСоздания, 60);
			Иначе
				Объект.СписаниеТоваров = РезультатСоздания;
				Если ЗначениеЗаполнено(Объект.СписаниеТоваров) Тогда
					Элементы.КомандаСоздатьСписаниеТоваров.Видимость = Ложь;
					ЭтаФорма.Записать();
					ОткрытьФорму("Документ.СписаниеТоваров.ФормаОбъекта", Новый Структура("Ключ", Объект.СписаниеТоваров));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Элементы.ГруппаСписаниеТоваров.Видимость = РассчитатьВидимостьСписанияТоваров(Объект.Дата, Объект.СписаниеТоваров);
	Элементы.КомандаСоздатьСписаниеТоваров.Видимость = Не ЗначениеЗаполнено(Объект.СписаниеТоваров);
	
КонецПроцедуры

// Обработка изменения реквизитов документа.
// Параметры
//  Имя			– Строка			– Имя реквизита документа с полным путем (например Тавары.Номенклатура).
//  ЭтаФорма	– Форма				– Ссылка на форму документа. 
// 									  Если значение неопределено, производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
// 										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Стркутура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
&НаКлиенте
Функция ОбработкаРеквизитаУпр(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено)
	
	// ОБРАБОТКА РЕКВИЗИТОВ ДОКУМЕНТА
	Если Имя = "Перерасход.Номенклатура" Тогда 
		
		Рез=РаботаСДокументамиКлиент.дкОбработкаРеквизитаКлиент(Объект,"Товары.Номенклатура",ТекСтрока,ЭтаФорма,ДопПараметры);
		ТекСтрока.Коэффициент = ДопСерверныеФункции.ПолучитьРеквизит(ТекСтрока.ЕдиницаИзмерения, "Коэффициент");
		
	ИначеЕсли Имя = "ДействияСтационара.Номенклатура" Тогда
		
		Если ТипЗнч(ТекСтрока.ДействиеСтационара) = Тип("СправочникСсылка.Номенклатура") Тогда
			ДанныеСтроки = Новый Структура("НомерСтроки, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Количество, Коэффициент");
			ЗаполнитьЗначенияСвойств(ДанныеСтроки, ТекСтрока);
			ДанныеСтроки.Номенклатура = ТекСтрока.ДействиеСтационара;
			
			Рез=РаботаСДокументамиКлиент.дкОбработкаРеквизитаКлиент(Объект,"Товары.Номенклатура",ДанныеСтроки,ЭтаФорма,ДопПараметры);
			ЗаполнитьЗначенияСвойств(ТекСтрока, ДанныеСтроки);
			
			ТекСтрока.Коэффициент = ДопСерверныеФункции.ПолучитьРеквизит(ТекСтрока.ЕдиницаИзмерения, "Коэффициент");
		КонецЕсли;
		
	ИначеЕсли Имя = "Перерасход.ЕдиницаИзмерения" Или Имя = "ДействияСтационара.ЕдиницаИзмерения" Тогда
		
		ТекСтрока.Коэффициент = ДопСерверныеФункции.ПолучитьРеквизит(ТекСтрока.ЕдиницаИзмерения, "Коэффициент");
		
	Иначе 
		Возврат РаботаСДокументамиКлиент.дкОбработкаРеквизитаКлиент(Объект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
	
КонецФункции // ОбработкаРеквизита()

&НаКлиенте
Процедура ДействияСтационараПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элемент.ТекущиеДанные;
		ТекущиеДанные.ИдентификаторЭлемента = Новый УникальныйИдентификатор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСтационараВидДействияПриИзменении(Элемент)
	
	ПривестиТипДанныхДействияСтационараКВидуДействия();
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСтационараДействиеСтационараПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДействияСтационара.ТекущиеДанные;
	
	ОбработкаРеквизитаУпр("ДействияСтационара.Номенклатура", ТекущиеДанные);
	
	// Автоопределение вида действия стационара, если не заполнено при выборе самого действия
	Если ЗначениеЗаполнено(ТекущиеДанные.ДействиеСтационара) Тогда
		Если ТипЗнч(ТекущиеДанные.ДействиеСтационара) = Тип("СправочникСсылка.ДействияМедсестрыСтационара") Тогда
			ТекущиеДанные.ВидыДействийСтационара = ПредопределенноеЗначение("Перечисление.ВидыДействийСтационара.Манипуляции");
			
		ИначеЕсли ТипЗнч(ТекущиеДанные.ДействиеСтационара) = Тип("СправочникСсылка.Номенклатура") Тогда
			
			ВидНоменклатуры = ДопСерверныеФункции.ПолучитьРеквизит(ТекущиеДанные.ДействиеСтационара, "ВидНоменклатуры");
			Если ВидНоменклатуры = ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Материал") Тогда 
				ТекущиеДанные.ВидыДействийСтационара = ПредопределенноеЗначение("Перечисление.ВидыДействийСтационара.Медикаменты");
			ИначеЕсли ВидНоменклатуры = ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Услуга") Тогда 
				ТекущиеДанные.ВидыДействийСтационара = ПредопределенноеЗначение("Перечисление.ВидыДействийСтационара.Процедуры");
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекущиеДанные.ВидыДействийСтационара = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСтационараДействиеСтационараНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УстановитьПараметрыВыбораДействияСтационара();
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСтационараЕдиницаИзмеренияПриИзменении(Элемент)
	
	ОбработкаРеквизитаУпр("ДействияСтационара.ЕдиницаИзмерения", Элементы.ДействияСтационара.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерерасходНоменклатураПриИзменении(Элемент)
	
	ОбработкаРеквизитаУпр("Перерасход.Номенклатура", Элементы.Перерасход.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерерасходЕдиницаИзмеренияПриИзменении(Элемент)
	
	ОбработкаРеквизитаУпр("Перерасход.ЕдиницаИзмерения", Элементы.Перерасход.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписаниеТоваровПриИзменении(Элемент)
	
	Элементы.КомандаСоздатьСписаниеТоваров.Видимость = Не ЗначениеЗаполнено(Объект.СписаниеТоваров);

КонецПроцедуры

// Функция осуществляет обработку считывания штрих-кода номенклатуры.
//
// Параметры:
//  Номенклатура   - <СправочникСсылка.Номенклатура>
//                 - Номенклатура, штрих-код которой был отсканирован.
//
//  Единица        - <СправочникСсылка.ЕдиницыИзмерения>
//                 - Единица измерения отсканированной номенклатуры.
//
//  Количество     - <Число>
//                 - Количество отсканированной номенклатуры.
//
//  СШК            - <Строка>
//                 - Идентификатор сканера штрих-кода, с которым связано данное
//                   событие.
//
// Возвращаемое значение:
//  <Булево>       - Данная ситуация обработана.
//
//&НаКлиенте
//Функция СШКНоменклатура(Номенклатура, Единица, Количество, СШК, ХарактеристикаНоменклатуры = Неопределено, Цена = 0) Экспорт
&НаКлиенте
Функция СШКНоменклатура(ДанныеНоменклатуры, СШК) Экспорт
	Номенклатура				= ДанныеНоменклатуры.Номенклатура;
	Количество					= ДанныеНоменклатуры.Количество;
	ХарактеристикаНоменклатуры	= ДанныеНоменклатуры.ХарактеристикаНоменклатуры;
	Единица						= ДанныеНоменклатуры.ЕдиницаИзмерения;
	СерияНоменклатуры           = ДанныеНоменклатуры.СерияНоменклатуры;
	
	ТабличнаяЧасть	= Объект.ДействияСтационара;
	Отбор = РаботаСДокументамиКлиент.ЧтениеШтрихкода_ОтборДляПоискаСтрокиДокумента(ДанныеНоменклатуры);
	Отбор.Вставить("ДействиеСтационара", Номенклатура);
	Отбор.Удалить("Номенклатура");
	мсСтрокиТовары = ТабличнаяЧасть.НайтиСтроки(Отбор);
	
	Если мсСтрокиТовары.Количество() = 0 Тогда
		// Определяем, следует добавить новую строку или использовать текущую
		ТекущаяСтрока = Элементы.ДействияСтационара.ТекущиеДанные;
		Если ТекущаяСтрока <> Неопределено
			И (Не ЗначениеЗаполнено(ТекущаяСтрока.ДействиеСтационара) Или Номенклатура = ТекущаяСтрока.ДействиеСтационара)
			И Не ЗначениеЗаполнено(ТекущаяСтрока.СерияНоменклатуры)
		Тогда
			СтрокаТЧ = ТекущаяСтрока;
			
			Если  ЗначениеЗаполнено(ТекущаяСтрока.ДействиеСтационара)
				И Не ЗначениеЗаполнено(Единица)
				И ЗначениеЗаполнено(ТекущаяСтрока.ЕдиницаИзмерения)
			Тогда
				Единица = ТекущаяСтрока.ЕдиницаИзмерения;
			КонецЕсли;
		Иначе
			// Добавление новой строки
			СтрокаТЧ = ТабличнаяЧасть.Добавить();
		КонецЕсли;
		
		СтрокаТЧ.ВидыДействийСтационара = ПредопределенноеЗначение("Перечисление.ВидыДействийСтационара.Медикаменты");
		СтрокаТЧ.ДействиеСтационара = Номенклатура;
		СтрокаТЧ.Количество = Количество;
		СтрокаТЧ.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
		СтрокаТЧ.СерияНоменклатуры = СерияНоменклатуры;
		Если ЗначениеЗаполнено(Единица) Тогда
			СтрокаТЧ.ЕдиницаИзмерения = Единица;
		Иначе
			СтрокаТЧ.ЕдиницаИзмерения = ДопСерверныеФункции.ПолучитьРеквизит(Номенклатура, "ЕдиницаХраненияОстатков");
		КонецЕсли;
		
		СтрокаТЧ.Коэффициент = ДопСерверныеФункции.ПолучитьРеквизит(СтрокаТЧ.ЕдиницаИзмерения, "Коэффициент");
		
		ОбработкаРеквизитаУпр("ДействияСтационара.Номенклатура", СтрокаТЧ);
	Иначе
		// Увеличивается количество в существующей строке
		СтрокаТЧ = мсСтрокиТовары[0];
		СтрокаТЧ.Количество = СтрокаТЧ.Количество + Количество;      
	КонецЕсли;

	Возврат Истина;
	
КонецФункции // СШКНоменклатура()

&НаСервереБезКонтекста
Функция РассчитатьВидимостьСписанияТоваров(Дата, СписаниеТоваров)
	
	Возврат ЗначениеЗаполнено(СписаниеТоваров)
		Или Не УправлениеНастройками.ПолучитьПериодическийПараметрУчетнойПолитики("СписыватьМатериалыСтационараСразу", Дата);
	
КонецФункции

&НаСервереБезКонтекста	
Функция СоздатьДокументСписания(ДокументОснование)
	
	ДокументСписания = Документы.СписаниеТоваров.СоздатьДокумент();
	ДокументСписания.Заполнить(ДокументОснование);
	Если ДокументСписания.Товары.Количество() = 0 Тогда
		Возврат НСтр("ru='В документе нет позиций для списания по складу.'");
	КонецЕсли;

	ДокументСписания.Дата = ТекущаяДата();
	ДокументСписания.Филиал = ДокументОснование.Филиал;
	ДокументСписания.Ответственный = ОбщегоНазначения.ТекущийПользователь();
	
	ДокументСписания.Комментарий = НСтр("ru='Списание по документу " + ДокументОснование + "'");
	
	ДокументСписания.Записать();
	Попытка
		ДокументСписания.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
	КонецПопытки;
	
	Возврат ДокументСписания.Ссылка;
	
КонецФункции	

&НаКлиенте
Процедура ПривестиТипДанныхДействияСтационараКВидуДействия()
	
	ТекущиеДанные = Элементы.ДействияСтационара.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ВидыДействийСтационара) Тогда
		Если ТекущиеДанные.ВидыДействийСтационара = ПредопределенноеЗначение("Перечисление.ВидыДействийСтационара.Манипуляции") Тогда
			ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.ДействияМедсестрыСтационара");
		Иначе
			ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
		КонецЕсли;
		ТекущиеДанные.ДействиеСтационара = ОписаниеТипа.ПривестиЗначение(ТекущиеДанные.ДействиеСтационара);
	Иначе
		ТекущиеДанные.ДействиеСтационара = Неопределено;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыВыбораДействияСтационара()
	
	ПараметрыВыбораЗначения = Новый Массив;
	
	ТекущиеДанные = Элементы.ДействияСтационара.ТекущиеДанные;
	
	Элементы.ДействияСтационараДействиеСтационара.ВыбиратьТип = (ТекущиеДанные.ДействиеСтационара = Неопределено);
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ВидыДействийСтационара)
		И ТекущиеДанные.ВидыДействийСтационара <> ПредопределенноеЗначение("Перечисление.ВидыДействийСтационара.Манипуляции")
	Тогда
		Если ТекущиеДанные.ВидыДействийСтационара = ПредопределенноеЗначение("Перечисление.ВидыДействийСтационара.Процедуры") Тогда
			ПараметрыВыбораЗначения.Добавить(Новый ПараметрВыбора("Отбор.ВидНоменклатуры", ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Услуга")));
		ИначеЕсли ТекущиеДанные.ВидыДействийСтационара = ПредопределенноеЗначение("Перечисление.ВидыДействийСтационара.Медикаменты") Тогда
			ПараметрыВыбораЗначения.Добавить(Новый ПараметрВыбора("Отбор.ВидНоменклатуры", ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Материал")));
		КонецЕсли;
	КонецЕсли;
		
	Элементы.ДействияСтационараДействиеСтационара.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСтационараДействиеСтационараАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	УстановитьПараметрыВыбораДействияСтационара();
КонецПроцедуры

&НаКлиенте
Процедура ДействияСтационараСерияНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ДействияСтационара.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ДействиеСтационара) Тогда 
		Возврат;	
	КонецЕсли;
	ПараметрыФормы = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, Склад, ЕдиницаИзмерения, ЭтоПодбор, ТолькоВНаличии", ТекущиеДанные.ДействиеСтационара, ТекущиеДанные.ХарактеристикаНоменклатуры, 
					?(ЗначениеЗаполнено(ТекущиеДанные.Склад), ТекущиеДанные.Склад, Объект.Склад), ТекущиеДанные.ЕдиницаИзмерения, Ложь, Истина);
	ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.ФормаПодбораСерийНоменклатуры", ПараметрыФормы, Элемент,ПараметрыФормы,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерерасходСерияНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Перерасход.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда 
		Возврат;	
	КонецЕсли;
	ПараметрыФормы = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, Склад, ЕдиницаИзмерения, ЭтоПодбор, ТолькоВНаличии", ТекущиеДанные.Номенклатура, ТекущиеДанные.ХарактеристикаНоменклатуры, 
					?(ЗначениеЗаполнено(ТекущиеДанные.Склад), ТекущиеДанные.Склад, Объект.Склад), ТекущиеДанные.ЕдиницаИзмерения, Ложь, Истина);
	ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.ФормаПодбораСерийНоменклатуры", ПараметрыФормы, Элемент,ПараметрыФормы,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Добавлено Макеев (
	омг_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// )
КонецПроцедуры
